Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
/// File Name    : r_dlms_data.c
// Drivers  
#include "typedef.h"
#include "emeter3_structs.h"

// DLMS  
#include "r_dlms_data.h"				// DLMS Data Definitions  
#include "r_dlms_obis.h"				// DLMS OBIS Definitions  
#include "r_dlms_obis_ic.h"				// DLMS OBIS IC Definitions  
#include "DLMS_User.h"					// DLMS User Definitions  
#if SHA1_ENABLE
#include "r_sha.h"					// SHA-1 Library  
#endif

#if MD5_ENABLE
#include "r_md5.h"					// MD5 Library  
#endif

#if AES_ENABLE
// HLS  
#include "r_dlms_data_hls.h"				// DLMS Data High level security Definitions  
#endif

// Standard Lib  
#include <string.h>						// String Standard Lib  

//R ENESAS DRIVER, TO BE REMOVE 
#include "eeprom.h"
////#include "r_cg_userdefine.h"
#include "r_dlms_typedef.h"				// DLMS Type Definitions  
#include "em_core.h"

#include "memoryOps.h"
#include "e2rom.h"
#include "survey.h"
#include "tampers.h"
#include "utilities.h"
//Macro definitions

//Typedef definitions

extern uint32_t g_Class07_Event_EntriesInUse[];
extern uint32_t g_Class07_Event_MaxEntries[];
//Imported global variables and functions (from other files)
void generate_bill(uint8_t dat, uint8_t mth, uint8_t yr, uint8_t hrs, uint8_t mnts, uint8_t secs, uint8_t bill_type);
int8_t is_rtc_good(ext_rtc_t p_rtc);

// * Imported from r_dlms_data_ic.c
// * For data access
// *
// * All of following variables are linked into each specified-child-table.
// * Refer to each child-table in r_dlms_data_ic.c
// Class ID = 07 - Profile generic class  
#if (defined(USED_CLASS_07) && USED_CLASS_07 == 1)

//Unsigned32  range_end_entry, range_start_entry;	// these are now local variables
// Clock (ATTR_TYPE_OCTET_STRING, 12bytes)  
void find_num_between_lp_entries(date_time_t* from_date_time, date_time_t* to_date_time, uint32_t* range_start_entry, uint32_t* range_end_entry);
void find_num_between_dlp_entries(date_time_t* from_date_time, date_time_t* to_date_time, uint32_t* range_start_entry, uint32_t* range_end_entry);

//void find_num_between_lp_entries(void);
//void find_num_between_dlp_entries(void);
extern const Unsigned16 	g_Class07_BlockloadCaptureObjectsLength;
extern const Unsigned16 	g_Class07_BillingCaptureObjectsLength;
extern const Unsigned16 	g_Class07_InstCaptureObjectsLength;
//date_time_t	from_date_time;// now a local variable
//date_time_t	to_date_time;	// now a local variable

#endif
// Class ID = 64 - Security setup class  
#if (defined(USED_CLASS_64) && USED_CLASS_64 == 1)
extern const class64_child_record_t g_ChildTableClass64[];  // Security setup reference list    
extern const Unsigned16 g_ChildTableLengthClass64;  		// Security setup reference length  
#endif
#if (defined(USED_CLASS_01) && USED_CLASS_01 == 1)
// Block load profile parameter  
extern Unsigned16		g_Class01_EventCode[7];// = {69,101,121,201,251,0,0};
#endif
//Exported global variables and functions (to be accessed by other files)

//Private global variables and functions
// Class ID = 07 - Profile generic class  
#if (defined(USED_CLASS_07) && USED_CLASS_07 == 1)
	extern Unsigned32					g_Class07_Blockload_EntriesInUse;
	extern Unsigned16					g_Class07_Blockload_CurrentEntry;
	extern Unsigned32					g_Class07_Dailyload_EntriesInUse;
	extern Unsigned16					g_Class07_Dailyload_CurrentEntry;
	extern Unsigned32					g_Class07_Billing_EntriesInUse;
	extern Unsigned16					g_Class07_Billing_CurrentEntry;

//extern Unsigned16					g_Class07_Event_CurrentEntry[];
//extern Unsigned32					g_Class07_Event_EntriesInUse[];

const scaler_unit_t		g_Class07_InstScalerBuffer[] =
{
	//{SCALAR_NULL, PHY_UNIT_NONE				},	// Clock  
	{SCALAR_AMPERE, PHY_UNIT_AMPERE				},	// Ir current   
	{SCALAR_AMPERE, PHY_UNIT_AMPERE				},	// Iy current  
	{SCALAR_AMPERE, PHY_UNIT_AMPERE				},	// Ib current  
	{SCALAR_VOLTAGE, PHY_UNIT_VOLT				},	// Vr Voltage   
	{SCALAR_VOLTAGE, PHY_UNIT_VOLT				},	// Vy Voltage   
	{SCALAR_VOLTAGE, PHY_UNIT_VOLT				},	// Vb Voltage   
	{SCALAR_PF, PHY_UNIT_NONE				},	// Signed Power Factor  - R
	{SCALAR_PF, PHY_UNIT_NONE				},	// Signed Power Factor  - Y
	{SCALAR_PF, PHY_UNIT_NONE				},	// Signed Power Factor  - B
	{SCALAR_PF, PHY_UNIT_NONE				},	// Signed Power Factor  - Three phase
	{SCALAR_HERTZ, PHY_UNIT_HERTZ				},	// Frequency  
	{SCALAR_VA, PHY_UNIT_VOLT_AMPERE			},	// Apparent Power  
	{SCALAR_WATT, PHY_UNIT_WATT				},	// Signed Active Power    
	{SCALAR_WATT, PHY_UNIT_VAR				},	// Signed Reactive Power    
	{SCALAR_NULL, PHY_UNIT_MIN				},	// Cumulative power ON duration in minutes  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR				},	// Cumulative Energy - kWh  
	{SCALAR_WH, PHY_UNIT_VAR_HOUR				},	// Cumulative Energy - kvarh(Lag) 
	{SCALAR_VAH, PHY_UNIT_VAR_HOUR				},	// Cumulative Energy - kvarh(Lead) 
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR			},	// Cumulative Energy - kVAh 
	{SCALAR_MD, PHY_UNIT_WATT				},	// Maximum Demand , kW  
	//{SCALAR_NULL, PHY_UNIT_NONE				},	// MD kW time  
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE			},	// Maximum Demand , kVA  
	//{SCALAR_NULL, PHY_UNIT_NONE				},	// MD kVA time  
#ifdef BIDIR_METER	
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy – kWh export 
#endif
};

Unsigned8			g_Class07_Obj0_Capture_Enable = 1;

class07_blockload_entry_t	g_Class07_BlockLoadBuffer;

const scaler_unit_t		g_Class07_BlockloadScalerBuffer[] =
{
	//{SCALAR_NULL, PHY_UNIT_NONE				},	// RTC time  
#ifdef SURVEY_USES_AVERAGE_DATA	
	{SCALAR_AMPERE, PHY_UNIT_AMPERE				},	// Phase current   
	{SCALAR_AMPERE, PHY_UNIT_AMPERE				},	// Neutral current  
	{SCALAR_AMPERE, PHY_UNIT_AMPERE				},	// Neutral current  
	{SCALAR_NULL, PHY_UNIT_VOLT				},	// Voltage (no decimals)  
	{SCALAR_NULL, PHY_UNIT_VOLT				},	// Voltage (no decimals)
	{SCALAR_NULL, PHY_UNIT_VOLT				},	// Voltage (no decimals)
#endif	
	{SCALAR_BL_WH, PHY_UNIT_WATT_HOUR				},	// Cumulative Energy - kWh  
#ifdef SURVEY_USES_REACTIVE_DATA
	{SCALAR_BL_WH, PHY_UNIT_VAR_HOUR				},	// Cumulative Energy - kvarh(Lag) 
	{SCALAR_BL_WH, PHY_UNIT_VAR_HOUR				},	// Cumulative Energy - kvarh(Lead) 
#endif
	{SCALAR_BL_WH, PHY_UNIT_VOLT_AMPERE_HOUR			},	// Cumulative Energy - kVAh 
#ifdef SURVEY_USES_EXPORT_DATA	
	{SCALAR_BL_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy - kWh export 
#endif
#ifdef SURVEY_USES_AVERAGE_PF
	{SCALAR_AMPERE, PHY_UNIT_NONE			},	// Block Power Factor R-phase  - Scalar Ampere is used since a value of -2 is required
	{SCALAR_AMPERE, PHY_UNIT_NONE			},	// Block Power Factor Y-phase  - Scalar Ampere is used since a value of -2 is required
	{SCALAR_AMPERE, PHY_UNIT_NONE			},	// Block Power Factor B-phase  - Scalar Ampere is used since a value of -2 is required
#endif
#ifdef SURVEY_USES_FREQ_DATA	// SCALAR_HERTZ
	{SCALAR_APF, PHY_UNIT_HERTZ			},	// Frequency	
#endif
#ifdef SURVEY_USES_DEMAND_DATA
	{SCALAR_VA, PHY_UNIT_VOLT_AMPERE			},	// Demand kva
	{SCALAR_VA, PHY_UNIT_WATT			},	// Demand kw
#endif
};

class07_dailyload_entry_t	g_Class07_DailyLoadBuffer;

#ifdef SMALL_DAILY_LOG
const scaler_unit_t			g_Class07_DailyloadScalerBuffer[] =
{
	//{SCALAR_NULL, PHY_UNIT_NONE		},	// RTC time  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR		},	// Cumulative Energy – kWh  
	#ifdef BIDIR_METER	
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy – kWh export 
	#else
	{SCALAR_WH, PHY_UNIT_VOLT_AMPERE_HOUR			},	// Cumulative Energy - kVAh 
	#endif
};
#else
	#ifdef DAILY_POWER_ON_LOGGING
	const scaler_unit_t			g_Class07_DailyloadScalerBuffer[] =
	{
		{SCALAR_WH, PHY_UNIT_WATT_HOUR		},	// Cumulative Energy – kWh  
		{SCALAR_WH, PHY_UNIT_VOLT_AMPERE_HOUR			},	// Cumulative Energy - kVAh 
		{SCALAR_NULL, PHY_UNIT_NONE		},	// Daily Power On Minutes  
	};
	#else
	const scaler_unit_t			g_Class07_DailyloadScalerBuffer[] =
	{
		{SCALAR_WH, PHY_UNIT_WATT_HOUR		},	// Cumulative Energy – kWh  
		{SCALAR_WH, PHY_UNIT_VOLT_AMPERE_HOUR			},	// Cumulative Energy - kVAh 
		{SCALAR_WH, PHY_UNIT_VAR_HOUR		},	// Cumulative Energy – kVarh_lag  
		{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy - kVArh_lead 
	};
	#endif
#endif

class07_billing_entry_t		g_Class07_BillingBuffer;

