Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
const scaler_unit_t			g_Class07_BillingScalerBuffer[] =
{// all date time elements are not described
	{SCALAR_APF, PHY_UNIT_NONE			},	// Average power factor for billing  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy – kWh  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ1  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ2  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ3  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ4  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ5  
#if (defined(TARIFFS) && TARIFFS == 8)
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ6  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ7  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR	},	// Cumulative Energy kWh TZ8  
#endif
	{SCALAR_WH, PHY_UNIT_VAR_HOUR	},	// Cumulative Energy kvarh (Lag)  
	{SCALAR_WH, PHY_UNIT_VAR_HOUR	},	// Cumulative Energy kvarh (Lead))  
	
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy – kVAh  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ1  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ2  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ3  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ4  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ5
#if (defined(TARIFFS) && TARIFFS == 8)
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ6  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ7  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ8
#endif
	
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW  
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ1 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ2 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ3 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ4 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ5 
#if (defined(TARIFFS) && TARIFFS == 8)
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ6 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ7 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ8 
#endif
	
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA  
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ1 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ2 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ3 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ4 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ5 
#if (defined(TARIFFS) && TARIFFS == 8)
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ6 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ7 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ8 
#endif
	
	{SCALAR_NULL, PHY_UNIT_MIN		},	// Billing power ON duration in minutes  

#ifdef BILLING_HAS_TAMPER_COUNT
	{SCALAR_NULL, PHY_UNIT_NONE		},	// cumulative tamper count  
#endif
	
#ifdef TOD_HAS_KVARH_LAG
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ1
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ2
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ3
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ4
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ5
#if (defined(TARIFFS) && TARIFFS == 8)
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ6
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ7
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh TZ8
#endif
#endif

#ifdef BIDIR_METER
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy – kWh -export   
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy kWh TZ1-export   
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy kWh TZ2 -export  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy kWh TZ3 -export  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy kWh TZ4 -export  
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy kWh TZ5 -export  

	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh (Lag)  -export 
	{SCALAR_WH, PHY_UNIT_VAR_HOUR			},	// Cumulative Energy kvarh (Lead)) -export  

	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy – kVAh  -export 
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ1 -export  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ2 -export  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ3 -export  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ4 -export  
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh TZ5 -export  

	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW  -export 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ1 -export 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ2 -export 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ3 -export 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ4 -export 
	{SCALAR_MD, PHY_UNIT_WATT			},	// MD kW for TZ5 -export 
	
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA  -export 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ1 -export 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ2 -export 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ3 -export 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ4 -export 
	{SCALAR_MD, PHY_UNIT_VOLT_AMPERE	},	// MD kVA TZ5 -export 
	
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy – kwh_nonSolar_export   
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy – kwh_Solar_import   
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy – kwh_Solar_export   
#endif

#ifdef SPLIT_ENERGIES_REQUIRED
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy – kWh lag 
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy kWh lead
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy – kVAh lag 
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR		},	// Cumulative Energy kVAh lead
#endif	
};

class07_event_entry_t	g_Class07_EventBuffer;//[CLASS07_EVENT_MAX_PROFILE][CLASS07_EVENT_MAX_ENTRY];
extern Unsigned16				g_Class07_Event_CurrentEntry[] ;
extern Unsigned32				g_Class07_Event_EntriesInUse[];

const scaler_unit_t		g_Class07_Event0ScalerBuffer[] =
{
	//{SCALAR_NULL, PHY_UNIT_NONE				},	// Clock  
	//{SCALAR_NULL, PHY_UNIT_NONE				},	// Event code   
	{SCALAR_AMPERE, PHY_UNIT_AMPERE			},	// Current  IR 
	{SCALAR_AMPERE, PHY_UNIT_AMPERE			},	// Current  IY 
	{SCALAR_AMPERE, PHY_UNIT_AMPERE			},	// Current  IB 
	{SCALAR_NULL, PHY_UNIT_VOLT			},	// Voltage  IR 
	{SCALAR_NULL, PHY_UNIT_VOLT			},	// Voltage  IY 
	{SCALAR_NULL, PHY_UNIT_VOLT			},	// Voltage  IB 
	{SCALAR_AMPERE, PHY_UNIT_NONE			},	// Signed Power Factor R-phase 
	{SCALAR_AMPERE, PHY_UNIT_NONE			},	// Signed Power Factor Y-phase 
	{SCALAR_AMPERE, PHY_UNIT_NONE			},	// Signed Power Factor B-phase 
	{SCALAR_WH, PHY_UNIT_WATT_HOUR			},	// Cumulative Energy - kWh 
#ifdef EVENTDATA_RECORDS_KVAH	
	{SCALAR_VAH, PHY_UNIT_VOLT_AMPERE_HOUR			},	// Cumulative Energy - kVAh  
#endif	
};

#endif


void ConvertRTCDate(date_time_t*dst, ext_rtc_t*src)
{
	int16_t year = 2000+src->year;
	dst->year_high=year>>8;
	dst->year_low=year&0xff;
	dst->month=src->month;
	dst->day_of_month=src->date;
	dst->day_of_week=src->day;
	dst->hour=src->hour;
	dst->minute=src->minute;
	dst->second=src->second;
	dst->hundredths=(uint8_t)TIME_HUNDREDTHS_NOT_SPECIFIED;	// not available
	dst->deviation_high=128;
	dst->deviation_low=0;	// together the two mean NOT SPECIFIED 
	dst->clock_status=(uint8_t)NOT_SPECIFIED;
	if(dst->day_of_week==0)
		dst->day_of_week=7;
}

void ConvertBackToRTC(ext_rtc_t*dst, date_time_t*src)
{
	int16_t year = ((src->year_high)*256 + src->year_low);
	if(year>2000)
		dst->year = year - 2000;
	else
		dst->year = 0;
		
	dst->month = src->month;
	dst->date = src->day_of_month;
	dst->day=src->day_of_week;
	dst->hour = src->hour;
	dst->minute = src->minute;
	dst->second =src->second;
}

int8_t is_rtc_good(ext_rtc_t p_rtc)
{
	int8_t result;	// 1 = good, 0 - bad
	
