Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
	uint32_t addr;
	int16_t search_index; 
	int16_t first_index;	// oldest record
	int16_t last_index;	// the last_index is the newest record
	int16_t low_index;
	int16_t high_index;
	int16_t previous_search_index;
	int8_t match_result,done;
	
//To find the index of the entry which matches the start time, start from the oldest record
//The ctldata.survey_wrt_ptr always points to the oldest record, if there is overflow
//If there is no overflow, then the oldest record index is 0

	uint16_t no_of_records_per_day =	1;	// there is only one record per day

	if(g_Class07_Dailyload_EntriesInUse==NO_OF_DAILY_LOG_DATA)
	{// here we have an overflow condition
		first_index = (ctldata.daily_log_wrt_ptr - (int32_t)DAILYLOG_BASE_ADDRESS)/(int32_t)DAILY_LOG_PTR_INC;	// oldest record
// the following formula ensures that last_index will always be greater than search_index
// we must take care to finally return / use the last_index as (last_index%NO_OF_SURVEY_RECORDS)
		last_index = (first_index-1)+ NO_OF_DAILY_LOG_DATA;
	}
	else
	{// here there is no overflow
		first_index=0;	// oldest record
		last_index = g_Class07_Dailyload_EntriesInUse - 1;	// newest record index
	}
	
// we should make sure that valid from_date_time and to_date_time have been provided
// towards this end - to_date_time must be >=from_date_time
// compare 	record_date_time with from_date_time
	match_result = R_OBIS_CompareDateTime((Unsigned8 *)from_date_time, (Unsigned8 *)to_date_time);
	
	if(match_result>0)
	{// from_date_time is > to_date_time - we should return no data
		*range_start_entry=0;
		*range_end_entry=0;
		return;
	}
		
// we should also determine if from_date_time lies within our data
// from_date_time should be greater than the oldest record time, and less than newest record time

	done=0;

	getDailyLogRecordDateTime(first_index,&record_date_time);
	match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
	if(match_result>0)
	{// start_date>from_date i.e from_date<start_date 
		*range_start_entry=first_index;	// should be (first_index-first_index) - must be done before exiting
		search_index=first_index;
		
	// check if the to_date_time<start date
//	getDailyLogRecordDateTime(first_index,&record_date_time);	// we already have read this above
		match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)to_date_time);
		if(match_result>0)
		{//to_date_time<start_time
			*range_start_entry=0;
			*range_end_entry=0;
			return;
		}
	// here from_date<start_date AND to_date_time>=start_time		
	}
	else
	{// here the from_date_time is >= start_time 
	// we should verify that the from_date_time<=end_time
		getDailyLogRecordDateTime(last_index,&record_date_time);
		match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
		if(match_result<0)
		{// from_date_time > end time
		// the following two lines sends no data
			*range_start_entry=0;
			*range_end_entry=0;
			return;
		}
		else
		{// here the from_date_time lies within the data available
		// we have already checked the first_index and the last_index
		// let us do a binary search now
		
			low_index = first_index;
			high_index = last_index;
			previous_search_index = -1;
			
			done=0;
			do
			{
				search_index = (low_index+high_index)/2;
				if(search_index==previous_search_index)
				{
					done=1;
					// we should run one more check on search_index+1
					// when we come here then the record_date_time is < from_date_time 
					// before calling it a day - if the next record is also <= from_date_time then it would be a better result
					// also if the next record is > from_date_time
					getDailyLogRecordDateTime((search_index+1),&record_date_time);
					match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
					if(match_result<=0)
						search_index=search_index+1;	// this may be a better result
				}
				else
				{
					getDailyLogRecordDateTime(search_index,&record_date_time);
					match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
					if(match_result==0)
					{
						done=1;
					}
					else
					{
						if(match_result>0)
						{//record_date_time is > from_date_time - from_date_time is behind the search_index
							high_index=search_index;
						}
						else
						{// here match_result is <0
						// record_date_time is < from_date_time - from_date_time is ahead of the search_index
							low_index=search_index;
						}
					}
					previous_search_index = search_index;
				}
			}
			while(done==0);
			
// after exiting thie while we will have the start_entry
			*range_start_entry=search_index;
		}
	}
// at this place the range_start_entry has been determined
// now we should look for the end_entry - which should lie between the search_index and the last_index

	low_index = search_index;
	high_index = last_index;
	previous_search_index = -1;
	
	done=0;
		
	do
	{
		search_index = (low_index+high_index)/2;
		if(search_index==previous_search_index)
		{
			done=1;
			// we should run one more check on search_index+1
			// when we come here then the record_date_time is < to_date_time 
			// before calling it a day - if the next record is also <= from_date_time then it would be a better result
			// also if the next record is > from_date_time
			getDailyLogRecordDateTime((search_index+1),&record_date_time);
			match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)to_date_time);
			if(match_result<=0)
				search_index=search_index+1;	// this may be a better result
		}
		else
		{
			getDailyLogRecordDateTime(search_index,&record_date_time);
			match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)to_date_time);
			if(match_result==0)
			{
				done=1;
			}
			else
			{
				if(match_result>0)
				{//record_date_time is > to_date_time - to_date_time is behind the search_index
					high_index=search_index;
				}
				else
				{// here match_result is <0
				// record_date_time is < to_date_time - to_date_time is ahead of the search_index
					low_index=search_index;
				}
			}
			previous_search_index = search_index;
		}
	}
	while(done==0);
		
// upon exiting this loop, we will have the range_end_entry
	*range_end_entry = search_index;	

// Convert the range_start_entry and range_end_entry between 0 and (NO_OF_SURVEY_RECORDS-1) 
	*range_start_entry = *range_start_entry - first_index + 1;
	*range_end_entry = *range_end_entry - first_index + 1;
}
/*
void find_num_between_dlp_entries(date_time_t* from_date_time, date_time_t* to_date_time, uint32_t* range_start_entry, uint32_t* range_end_entry)
{
	date_time_t record_date_time;
	ext_rtc_t record_rtc_time;

