Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
	uint32_t addr;
	int16_t search_index, initial_search_index;
	
	int8_t match_result,loop_count,done;
	
//To find the index of the entry which matches the start time, start from the oldest record
//The ctldata.daily_log_wrt_ptr always points to the oldest record, if there is overflow
//If there is no overflow, then the oldest record index is 0

	if(g_Class07_Dailyload_EntriesInUse==NO_OF_DAILY_LOG_DATA)
	{// here we have an overflow condition
		search_index = (ctldata.daily_log_wrt_ptr - (int32_t)DAILYLOG_BASE_ADDRESS)/(int32_t)DAILY_LOG_PTR_INC;	// oldest record
	}
	else
		search_index=0;	// oldest record
		
	initial_search_index=search_index;
	
// Search in the increasing time direction	
	addr=(int32_t)DAILYLOG_BASE_ADDRESS + (int32_t)search_index*(int32_t)DAILY_LOG_PTR_INC;

	match_result = 0;
	loop_count=0;	// keeps count of number of days
	done=0;
	
	do
	{
//		EPR_Read_Test(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
		EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
		ConvertRTCDate(&record_date_time,&record_rtc_time);
		record_date_time.second = 0xff;
		record_date_time.hundredths = 0xff;
	
// compare 	record_date_time with from_date_time
		match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
		
		loop_count++;
		
		if(match_result>=0)
			done=1;	// record_date_time >= from_date_time
		else
		{
			search_index++;	// increase the search index by 1
			if((search_index-initial_search_index)>g_Class07_Dailyload_EntriesInUse)
				search_index = initial_search_index + g_Class07_Dailyload_EntriesInUse;
			addr=(int32_t)DAILYLOG_BASE_ADDRESS + (int32_t)(search_index%NO_OF_DAILY_LOG_DATA)*(int32_t)sizeof(logdata_t);
		}
	}
	while ((done==0)&&(loop_count<NO_OF_DAILY_LOG_DATA));
	
// we will exit the loop if we have either found or crossed the from_date_time
// we will also exit the loop if we have searched all the data

	if((done==0)&&(loop_count==NO_OF_DAILY_LOG_DATA))
	{// no record was found with date_time >= from_date_time
		*range_start_entry=1;
		*range_end_entry=1;
		return;
	}

// here the done==1 and loop_count<NO_OF_DAYS_SURVEY_DATA

	if(match_result==0)
	{
		*range_start_entry=search_index+1;
	}
	else
	{// here match_result is > 0 - we have overshot - hence the actual record is in the past
	// search the past no_of_records_per_day by going back - this time search ends if match==0 or match <0
	// addr already points to the record whose datetime is > from_date_time
	// search_index is the index of that record
	
		loop_count=0;
		done=0;
		
		do
		{
			if(search_index==initial_search_index)
				done=1;	// no need to check any further - we have already reached the first record
			else
			{
			  decptr_maskless(&addr, DAILYLOG_BASE_ADDRESS, DAILYLOG_END_ADDRESS, DAILY_LOG_PTR_INC);
				search_index--;	// do we need to check for this value becoming -ve
//			EPR_Read_Test(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
				EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
				ConvertRTCDate(&record_date_time,&record_rtc_time);
				record_date_time.second = 0xff;
				record_date_time.hundredths = 0xff;
		
	// compare 	record_date_time with from_date_time
				match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)from_date_time);
				
				loop_count++;
				
				if(match_result<=0)
					done=1;	// record_date_time >= from_date_time
			}
		}
//		while ((done==0)&&(loop_count<no_of_records_per_day));
		while (done==0);
		
		// when we come out of the loop we would have the desired record	
		*range_start_entry=search_index+1;
	}

// we now have the range_start_entry - now to find the range_end_entry
// start from search_index and increase in steps of no_of_records_per_day till match_result>=0 or loop_count==NO_OF_DAILY_LOG_DATA 
// in either case we have the range_end_entry

	loop_count=0;
	done=0;

	search_index++;	// increase the search index by 1
	if((search_index-initial_search_index)>g_Class07_Dailyload_EntriesInUse)
		search_index = initial_search_index + g_Class07_Dailyload_EntriesInUse;
	addr=(int32_t)DAILYLOG_BASE_ADDRESS + (int32_t)(search_index%NO_OF_DAILY_LOG_DATA)*(int32_t)DAILY_LOG_PTR_INC;
	
	do
	{
//		EPR_Read_Test(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
		EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
		ConvertRTCDate(&record_date_time,&record_rtc_time);
		record_date_time.second = 0xff;
		record_date_time.hundredths = 0xff;
	
// compare 	record_date_time with from_date_time
		match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)to_date_time);
		
		loop_count++;
		
		if(match_result>=0)
			done=1;	// record_date_time >= from_date_time
		else
		{
			search_index++;	// increase the search index by 1
			if((search_index-initial_search_index)>g_Class07_Dailyload_EntriesInUse)
				search_index = initial_search_index + g_Class07_Dailyload_EntriesInUse;
			addr=(int32_t)DAILYLOG_BASE_ADDRESS + (int32_t)(search_index%NO_OF_DAILY_LOG_DATA)*(int32_t)DAILY_LOG_PTR_INC;
		}
	}
	while ((done==0)&&(loop_count<NO_OF_DAILY_LOG_DATA));

// we come out of the loop when record time matches or crosses the to_date_time	
	
	if(match_result==0)
		*range_end_entry = search_index+1;	// we have a match
	else
	{// we have overshot - keep going back till entry is found or match_result becomes -ve
	
		loop_count=0;
		done=0;
		
		do
		{
			if(search_index==initial_search_index)
				done=1;	// no need to check any further - we have already reached the first record
			else
			{
			  decptr_maskless(&addr, DAILYLOG_BASE_ADDRESS, DAILYLOG_END_ADDRESS, DAILY_LOG_PTR_INC);
				search_index--;	// do we need to check for this value becoming -ve
//			EPR_Read_Test(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
				EPR_Read(addr, (uint8_t*)&record_rtc_time, sizeof(ext_rtc_t));	// we will get 8 bytes
				ConvertRTCDate(&record_date_time,&record_rtc_time);
				record_date_time.second = 0xff;
				record_date_time.hundredths = 0xff;
		
	// compare 	record_date_time with from_date_time
				match_result = R_OBIS_CompareDateTime((Unsigned8 *)&record_date_time, (Unsigned8 *)to_date_time);
				
				loop_count++;
				
				if(match_result<=0)
					done=1;	// record_date_time >= from_date_time
			}
		}
//		while ((done==0)&&(loop_count<no_of_records_per_day));
		while (done==0);
	
		*range_end_entry = search_index+1;
	}
}
*/
void get_bill_data(unsigned int c1){
// bill data for one month - this is fairly huge
//	billdata_t billdata;
	int32_t addr;	
	int i;
	int tmonth;

// c1 is the index value received from client 
// if entries in use is 6 - then we will get c1 from 0,1,2,3,4,5
	if (c1==0)
	{
		composeCurrentBillData();
	}
	else
	{
		tmonth = g_Class07_Billing_CurrentEntry - c1 -1;
		if(tmonth<0)
			tmonth=tmonth+12;
		
		addr=(int32_t)BILLDATA_BASE_ADDRESS + (int32_t)tmonth*(int32_t)BILL_PTR_INC;			
		EPR_Read(addr, (uint8_t*)&g_Class07_BillingBuffer, sizeof(g_Class07_BillingBuffer));	// we will get 420+ bytes
	}
}

