Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
int16_t findEventCode(uint8_t event_code_bit, uint8_t event_type)
{
	int16_t dlmsEventCode=0;
	switch (event_code_bit)
	{
		case 1:
			if (event_type==1)
				dlmsEventCode=1;	// R-Ph voltage missing
			else
				dlmsEventCode=2;	// R-Ph voltage restored
			break;
			
		case 2:
			if (event_type==1)
				dlmsEventCode=3;	// Y-Ph voltage missing
			else
				dlmsEventCode=4;	// Y-Ph voltage restored
			break;
			
		case 3:
			if (event_type==1)
				dlmsEventCode=5;	// B-Ph voltage missing
			else
				dlmsEventCode=6;	// Y-Ph voltage restored
			break;
			
		case 4:
			if (event_type==1)	// Over voltage occurence
				dlmsEventCode=7;
			else
				dlmsEventCode=8;	// Over votlage restored
			break;
			
		case 5:
			if (event_type==1)
				dlmsEventCode=9;	// Low voltage
			else
				dlmsEventCode=10;
			break;
			
		case 6:
			if (event_type==1)
				dlmsEventCode=11;	// Voltage unbalance occurence
			else
				dlmsEventCode=12;
			break;
			
		case 7:
			if (event_type==1)
				dlmsEventCode=51;	// CT reverse R ph occurence
			else
				dlmsEventCode=52;
			break;
			
		case 8:
			if (event_type==1)
				dlmsEventCode=53;	// CT reverse Y ph occurence
			else
				dlmsEventCode=54;
			break;
			
		case 9:
			if (event_type==1)
				dlmsEventCode=55;	// CT reverse B ph occurence
			else
				dlmsEventCode=56;
			break;
			
		case 10:
			if (event_type==1)
				dlmsEventCode=57;	// CT OPEN R ph occurence
			else
				dlmsEventCode=58;
			break;
			
		case 11:
			if (event_type==1)
				dlmsEventCode=59;	// CT OPEN Y ph occurence
			else
				dlmsEventCode=60;
			break;
			
		case 12:
			if (event_type==1)
				dlmsEventCode=61;	// CT OPEN B ph occurence
			else
				dlmsEventCode=62;
			break;
			
		case 13:
			if (event_type==1)
				dlmsEventCode=63;	// Current Unbalance occurence
			else
				dlmsEventCode=64;
			break;
			
		case 14:
			if (event_type==1)
				dlmsEventCode=65;	// Current Bypass occurence
			else
				dlmsEventCode=66;
			break;
			
		case 15:
			if (event_type==1)
				dlmsEventCode=67;	// Overcurrent any phase occurence
			else
				dlmsEventCode=68;
			break;
			
		case 16:
			if (event_type==1)
//				dlmsEventCode=101;
				dlmsEventCode=102;	// Power Supply resotred
			else
//				dlmsEventCode=102;
				dlmsEventCode=101;	// Power Supply failed
			break;
			
		case 17:
			dlmsEventCode=151;	// RTC changed
			break;
			
		case 18:
			dlmsEventCode=152;	// MD INtegration period changed
			break;
			
		case 19:	
			dlmsEventCode=153;	// Load survey interval changed
			break;
			
		case 20:
			dlmsEventCode=154;	// Single action schedule
			break;
			
		case 21:
			dlmsEventCode=155;	// Activity calendar - Time Zone
			break;
			
		case 22:
		case 23:
			if (event_type==1)
				dlmsEventCode=201;	// Magnet Occurence
			else
				dlmsEventCode=202;
			break;
			
		case 24:
			if (event_type==1)
				dlmsEventCode=203;	// Neutral Disturbance occurence
			else
				dlmsEventCode=204;
			break;
			
		case 25:
			if (event_type==1)
				dlmsEventCode=205;	// Low pf occurence
			else
				dlmsEventCode=206;
			break;
			
		case 26:
			dlmsEventCode=251;	// Cover open
			break;
	}
	return dlmsEventCode;
}

void get_tamper_data(unsigned int c1,unsigned int c2){
// the first value is the child_index, and the second value refers to the index of the records of that group
// child index will technically go from 9 to 14 - being the entries in the g_ChildTableClass07
// The (childindex -9) will translate from 0 to 5.
// c2 represents the record number in the subgroup

	unsigned int childIndex = c1-9;
	eventdata_t eventdata;

	uint8_t* src_ptr;
	uint8_t* dst_ptr;

	unsigned int addr;
	int i;

	if(g_Class07_Event_EntriesInUse[childIndex]==g_Class07_Event_MaxEntries[childIndex])
	{// over flow condition
		i=g_Class07_Event_CurrentEntry[childIndex]+c2;
		
		if(i>=g_Class07_Event_MaxEntries[childIndex])
			i=i-g_Class07_Event_MaxEntries[childIndex];
	}
	else
	{
		i=c2;
	}
		
	
	switch(childIndex){
		case 0:	// This is event block 0
//			addr=EVENTS0_BASE_ADDRESS + i*sizeof(eventdata_t);
			addr=EVENTS0_BASE_ADDRESS + i*EVENT_PTR_INC;
			if (addr>EVENTS0_END_ADDRESS)
				addr=EVENTS0_BASE_ADDRESS;
			EPR_Read(addr, (uint8_t*)&eventdata, sizeof(eventdata_t));	// we will get 32 bytes
			break;
		
		case 1:	// This is event block 1
//			addr=EVENTS1_BASE_ADDRESS + i*sizeof(eventdata_t);
			addr=EVENTS1_BASE_ADDRESS + i*EVENT_PTR_INC;
			if (addr>EVENTS1_END_ADDRESS)
				addr=EVENTS1_BASE_ADDRESS;
			EPR_Read(addr, (uint8_t*)&eventdata, sizeof(eventdata_t));	// we will get 32 bytes
			break;
		
		case 2:	// This is event block 2
//			addr=EVENTS2_BASE_ADDRESS + i*sizeof(eventdata_t);
			addr=EVENTS2_BASE_ADDRESS + i*EVENT_PTR_INC;
			if (addr>EVENTS2_END_ADDRESS)
				addr=EVENTS2_BASE_ADDRESS;
			EPR_Read(addr, (uint8_t*)&eventdata, sizeof(eventdata_t));	// we will get 32 bytes
			break;
		
		case 3:	// This is event block 3
//			addr=EVENTS3_BASE_ADDRESS + i*sizeof(eventdata_t);
			addr=EVENTS3_BASE_ADDRESS + i*EVENT_PTR_INC;
			if (addr>EVENTS3_END_ADDRESS)
				addr=EVENTS3_BASE_ADDRESS;
			EPR_Read(addr, (uint8_t*)&eventdata, sizeof(eventdata_t));	// we will get 32 bytes
			break;
		
		case 4:	// This is event block 4
//			addr=EVENTS4_BASE_ADDRESS + i*sizeof(eventdata_t);
			addr=EVENTS4_BASE_ADDRESS + i*EVENT_PTR_INC;
			if (addr>EVENTS4_END_ADDRESS)
				addr=EVENTS4_BASE_ADDRESS;
			EPR_Read(addr, (uint8_t*)&eventdata, sizeof(eventdata_t));	// we will get 32 bytes
			break;
		
		case 5:	// This is event block 5
//			addr=EVENTS5_BASE_ADDRESS + i*sizeof(eventdata_t);
			addr=EVENTS5_BASE_ADDRESS + i*EVENT_PTR_INC;
			if (addr>EVENTS5_END_ADDRESS)
				addr=EVENTS5_BASE_ADDRESS;
			EPR_Read(addr, (uint8_t*)&eventdata, sizeof(eventdata_t));	// we will get 32 bytes
			break;
		
	}
// The record is now available in eventdata and needs to be transferred to g_Class07_EventBuffer

	ConvertRTCDate(&g_Class07_EventBuffer.clock_value,&eventdata.datetime);
// the remaining values cannot be copied straightaway - since the data types are different
	g_Class07_EventBuffer.event_code=findEventCode(eventdata.event_code_bit,eventdata.event_type);
	g_Class07_EventBuffer.current_value_IR=(eventdata.current_value_IR&(~_BV(14)));
	g_Class07_EventBuffer.current_value_IY=(eventdata.current_value_IY&(~_BV(14)));
	g_Class07_EventBuffer.current_value_IB=(eventdata.current_value_IB&(~_BV(14)));
	
