Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
	if((eventdata.current_value_IR&_BV(14))==0)
		g_Class07_EventBuffer.voltage_value_VR=eventdata.voltage_value_VR;
	else
		g_Class07_EventBuffer.voltage_value_VR=(int32_t)256+(int32_t)eventdata.voltage_value_VR;
	
	if((eventdata.current_value_IY&_BV(14))==0)
		g_Class07_EventBuffer.voltage_value_VY=eventdata.voltage_value_VY;
	else
		g_Class07_EventBuffer.voltage_value_VY=(int32_t)256+(int32_t)eventdata.voltage_value_VY;
		
	if((eventdata.current_value_IB&_BV(14))==0)
		g_Class07_EventBuffer.voltage_value_VB=eventdata.voltage_value_VB;
	else
		g_Class07_EventBuffer.voltage_value_VB=(int32_t)256+(int32_t)eventdata.voltage_value_VB;
		
		
//	g_Class07_EventBuffer.voltage_value_VR=eventdata.voltage_value_VR;
//	g_Class07_EventBuffer.voltage_value_VY=eventdata.voltage_value_VY;
//	g_Class07_EventBuffer.voltage_value_VB=eventdata.voltage_value_VB;
	
	g_Class07_EventBuffer.power_factor_R=eventdata.power_factor_R;
	g_Class07_EventBuffer.power_factor_Y=eventdata.power_factor_Y;
	g_Class07_EventBuffer.power_factor_B=eventdata.power_factor_B;
	g_Class07_EventBuffer.active_energy=eventdata.active_energy;
#ifdef EVENTDATA_RECORDS_KVAH	
	g_Class07_EventBuffer.apparent_energy=eventdata.apparent_energy;
#endif	
}


void get_lp_data(unsigned int c1){
// load survey profile	
// when the index is one - i.e. when the first record is sought c1=0
// the index must always lie between 0 and (NO_OF_SURVEY_RECORDS-1)
// The index is always referenced to the g_Class07_Blockload_CurrentEntry if 
// g_Class07_Blockload_EntriesInUse == NO_OF_SURVEY_RECORDS
// else the index was referenced to 0 if the buffer had not overflowed
	small_surveydata_t surveydata;
	ext_rtc_t tempRTC;
	uint32_t addr;
	unsigned int i;
	
	uint8_t* src_ptr;
	uint8_t* dst_ptr;
	
	if(g_Class07_Blockload_EntriesInUse==NO_OF_SURVEY_RECORDS)
	{// over flow condition
		i=g_Class07_Blockload_CurrentEntry+c1;
		if(i>=NO_OF_SURVEY_RECORDS)
			i=i-NO_OF_SURVEY_RECORDS;
	}
	else
	{
		i=c1;
	}
	
// the following if block is only for debugging	
//	if(c1>1437)
//	{
//		addr=SURVEY_BASE_ADDRESS + i*sizeof(surveydata_t);
//	}
	
//	addr=SURVEY_BASE_ADDRESS + i*sizeof(surveydata_t);
	addr=(int32_t)SURVEY_BASE_ADDRESS + (int32_t)i*(int32_t)SURVEY_PTR_INC;

	EPR_Read(addr, (uint8_t*)&surveydata, sizeof(small_surveydata_t));	// we will get 28 bytes for BIDIR and 10 bytes for UNIDIR
// now to use this to fill the g_Class07_BlockLoadBuffer
// only the date_time_t(12) and ext_rtc_t(8) are different

	ConvertShortDate_RTC(&tempRTC,&surveydata.shortDateTime);
	ConvertRTCDate(&g_Class07_BlockLoadBuffer.clock_value,&tempRTC);

// the remaining values cannot be copied straightaway - since the data types are different
#ifdef SURVEY_USES_AVERAGE_DATA		
	g_Class07_BlockLoadBuffer.current_value_IR=(surveydata.I_r&(~_BV(14)));	// remove the voltage 9th bit
	g_Class07_BlockLoadBuffer.current_value_IY=(surveydata.I_y&(~_BV(14)));	// remove the voltage 9th bit
	g_Class07_BlockLoadBuffer.current_value_IB=(surveydata.I_b&(~_BV(14)));	// remove the voltage 9th bit
	
	if((surveydata.I_r&_BV(14))==0)
		g_Class07_BlockLoadBuffer.voltage_value_VR=surveydata.V_r;
	else
		g_Class07_BlockLoadBuffer.voltage_value_VR=(int32_t)256+(int32_t)surveydata.V_r;
		
	if((surveydata.I_y&_BV(14))==0)
		g_Class07_BlockLoadBuffer.voltage_value_VY=surveydata.V_y;
	else
		g_Class07_BlockLoadBuffer.voltage_value_VY=(int32_t)256+(int32_t)surveydata.V_y;
		
	if((surveydata.I_b&_BV(14))==0)
		g_Class07_BlockLoadBuffer.voltage_value_VB=surveydata.V_b;
	else
		g_Class07_BlockLoadBuffer.voltage_value_VB=(int32_t)256+(int32_t)surveydata.V_b;
#endif		
		
	g_Class07_BlockLoadBuffer.kWh_value=surveydata.kwh_consumption;
	
#ifdef SURVEY_USES_REACTIVE_DATA
	g_Class07_BlockLoadBuffer.kvarh_lag_value=surveydata.kvarh_lag_consumption;
	g_Class07_BlockLoadBuffer.kvarh_lead_value=surveydata.kvarh_lead_consumption;
#endif

	g_Class07_BlockLoadBuffer.kVAh_value=surveydata.kvah_consumption;
	
#ifdef SURVEY_USES_EXPORT_DATA	
	g_Class07_BlockLoadBuffer.kWh_value_export=surveydata.kwh_consumption_export;	
#endif

#ifdef SURVEY_USES_AVERAGE_PF
	g_Class07_BlockLoadBuffer.avgPF_r=surveydata.avgPF_r;
	g_Class07_BlockLoadBuffer.avgPF_y=surveydata.avgPF_y;
	g_Class07_BlockLoadBuffer.avgPF_b=surveydata.avgPF_b;
#endif

#ifdef SURVEY_USES_FREQ_DATA
	g_Class07_BlockLoadBuffer.frequency=surveydata.frequency;
#endif

#ifdef SURVEY_USES_DEMAND_DATA
	g_Class07_BlockLoadBuffer.apparentDemand=surveydata.apparentDemand;
	g_Class07_BlockLoadBuffer.activeDemand=surveydata.activeDemand;
#endif

}


void get_dlp_data(unsigned int c1){
	logdata_t logdata;
	uint32_t addr;
	unsigned int i;

	if(g_Class07_Dailyload_EntriesInUse==NO_OF_DAILY_LOG_DATA)
	{// over flow condition
		i=g_Class07_Dailyload_CurrentEntry+c1;
		if(i>=NO_OF_DAILY_LOG_DATA)
			i=i-NO_OF_DAILY_LOG_DATA;
	}
	else
	{
		i=c1;
	}
	
//	addr=DAILYLOG_BASE_ADDRESS + c1*sizeof(logdata_t);
	addr=(int32_t)DAILYLOG_BASE_ADDRESS + (int32_t)i*(int32_t)DAILY_LOG_PTR_INC;
	EPR_Read(addr, (uint8_t*)&logdata, sizeof(logdata_t));	// we will get 16 bytes

// now to use this to fill the  g_Class07_DailyLoadBuffer
// only the date_time_t(12) and ext_rtc_t(8) are different
	ConvertRTCDate(&g_Class07_DailyLoadBuffer.clock_value,&logdata.datetime);

// the remaining values can be copied straightaway
#ifdef SMALL_DAILY_LOG
		g_Class07_DailyLoadBuffer.kWh_value=logdata.kWh_value;
	#ifdef BIDIR_METER	
		g_Class07_DailyLoadBuffer.kWh_value_export  =logdata.kWh_value_export;
	#else
		g_Class07_DailyLoadBuffer.kVAh_value  =logdata.kVAh_value;
	#endif
#else
	#ifdef DAILY_POWER_ON_LOGGING
		g_Class07_DailyLoadBuffer.dailyPonMinutes=logdata.dailyPonMinutes;
	#else
		g_Class07_DailyLoadBuffer.kWh_value=logdata.kWh_value;
		g_Class07_DailyLoadBuffer.kVAh_value  =logdata.kVAh_value;
		g_Class07_DailyLoadBuffer.kVArh_lag_value  =logdata.kVArh_lag_value;
		g_Class07_DailyLoadBuffer.kVArh_lead_value  =logdata.kVArh_lead_value;
	#endif
#endif
}

void get_time_data(unsigned long int c1, unsigned long int c2){}

Unsigned8 R_OBIS_ActionObjectMethod(
	st_Cosem_Method_Desc *cosem_method_desc,
	service_type_t service_type,
	Unsigned16 child_id,
	Unsigned8 *p_out_buf,
	Unsigned16 *p_out_len,
	Unsigned8 *p_data,
	Unsigned16 data_len,
	Unsigned8 *block_transfer
)
{
	// Result of action, def. is not Matched  
	Unsigned8 response_result = ACTION_RESULT_TYPE_UNMATCH;

	// Vars used to handle processing  
	Unsigned16	class_id;
	Unsigned16	method_id = (cosem_method_desc->Method_ID & 0x00FF);
	Unsigned8	b_have_client_data = (Unsigned8)(cosem_method_desc->Method_ID >> 8);

	// Vars used to encode data  
	void        *pbuffer;
	Unsigned16  length;
	Unsigned8   u8_data;
	Unsigned16  u16_data;
	Unsigned32  u32_data;
	Integer32   f32_data;
	attr_type_t type;

	// Params check  
	if (cosem_method_desc == NULL ||
		p_out_buf == NULL ||
		p_out_len == NULL ||
		block_transfer == NULL)
	{
		return TYPE_UNMATCH;
	}
	
	// Get information from attr descriptor  
	class_id = (
		((Unsigned16)cosem_method_desc->Class_ID[0] << 8) |
		((Unsigned16)cosem_method_desc->Class_ID[1])
	);

//	 * Default, marked to response to object layer that not use block transfer
//	 * Change this value to 1 at relative class processing (in below) to inform to
//	 * object layer that R_OBIS_GetObjectAttr() need to use block transfer
	*block_transfer = 0;

