Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
	// Default clear the optional data result to 0  
	*p_out_buf = ATTR_TYPE_NULL_DATA;
	*p_out_len = 0;

//	 * Temporary if (0) to prevent compile error
//	 * when no class is used
	if (0)
	{
		// Do nothing  
	}
#if (defined(USED_CLASS_07) && USED_CLASS_07 == 1)
	else if (class_id == 7)
	{
		class07_child_record_t	*p_child_record;

		// Get the child record  
		p_child_record = (class07_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);
	
		// Method 1 - reset(data)?  
		if (method_id == 1)
		{
			switch(child_id)
			{
				case 2: // Block Load Profile  
					g_Class07_Blockload_CurrentEntry = 0;
					g_Class07_Blockload_EntriesInUse = 0;
					ctldata.survey_wrt_ptr=SURVEY_BASE_ADDRESS;
					ctldata.overflow&=~SUR_OVERFLOW;
					e2write_flags|=E2_W_CTLDATA;
					break;
				case 4: // Daily profile  
					g_Class07_Dailyload_CurrentEntry = 0;
					g_Class07_Dailyload_EntriesInUse = 0;
					ctldata.daily_log_wrt_ptr=DAILYLOG_BASE_ADDRESS;
					ctldata.overflow&=~DAILYLOG_OVERFLOW;
					e2write_flags|=E2_W_CTLDATA;
					break;
				case 6: // Billing profile  
					g_Class07_Billing_CurrentEntry = 1;	// 0 earlier
					g_Class07_Billing_EntriesInUse = 1;	// 0 earlier
					Common_Data.history_ptr=1;
					e2write_flags|=E2_W_IMPDATA;
					ctldata.overflow&=~HISTORY_OVERFLOW;
					e2write_flags|=E2_W_CTLDATA;
					break;
				case 9:  // Event 0 profile  
				case 10: // Event 1 profile  
				case 11: // Event 2 profile  
				case 12: // Event 3 profile  
				case 13: // Event 4 profile  
				case 14: // Event 5 profile  
					g_Class07_Event_CurrentEntry[child_id-9] = 0;
					g_Class07_Event_EntriesInUse[child_id-9] = 0;
					break;
				default:
					// Do nothing 
					break;
			}
			response_result = ACTION_RESULT_SUCCESS;
		}
		// Method 2 - capture(data)  
		else if (method_id == 2)
		{
			switch(child_id)
			{
				case 2: // Block Load Profile
					// this option is not permitted as we are recording data as per the time - hence nay entry
					// written out of time is likely to be overwritten
					//R_OBIS_Class07_BlockloadUpdate();	// this function is replaced by our own
					break;
				case 4: // Daily profile 
					//R_OBIS_Class07_DailyloadUpdate(); // this function is replaced by our own
			    writeLogData(rtc.date,rtc.month,rtc.year,rtc.hour,rtc.minute,rtc.second); 
			    computeDailyLogEntries();
					break;
				case 6: // Billing profile
					//R_OBIS_Class07_BillingUpdate(); // this function is replaced by our own
					generate_bill(rtc.date,rtc.month,rtc.year,rtc.hour,rtc.minute,rtc.second, BT_TRANS);
					break;
				default:
					// Do nothing 
					break;
			}
			response_result = ACTION_RESULT_SUCCESS;
		}
		else if (method_id == 3)
		{
			//NOT support function for old version method
		}
		else if (method_id == 4)
		{
			//NOT support function for old version method
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_09) && USED_CLASS_09 == 1)
	else if (class_id == 9)
	{
		class09_child_record_t	*p_child_record;

		// Get the child record  
		p_child_record = (class09_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);
	
		// Method 1 - execute (data)?  
		if (method_id == 1)
		{
			// Do nothing  
			u16_data = ((Unsigned16)*(p_data + 1) << 8) | *(p_data + 2);
			for (u8_data = 0; u8_data < p_child_record->nr_scripts; u8_data ++)
			{
				script_t *check_script = (script_t *)(p_child_record->p_scripts + u8_data);

				if(u16_data == check_script->script_id)
				{
					//Execute script 
					if(R_OBIS_Class09_ScriptExecute(p_child_record->logical_name, u16_data))
					{
						response_result = ACTION_RESULT_SUCCESS;
					}
					break;
				}
				// Ensure no reset  
				R_USER_WDT_Restart();
			}
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_15) && USED_CLASS_15 == 1)
	else if (class_id == 15)
	{
		class15_child_record_t	*p_child_record;

		// Get the child record  
		p_child_record = (class15_child_record_t *)(
		R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);
	
		// Method 1 - reply_to_HLS_authentication (data)?  
		if (method_id == 1)
		{
//			 * TODO: put the custom verification method here, using
//			 * + secret method = p_child_record->mechanism_id (MD5, SHA-1, GMAC, etc ?)
//			 * + shared key    = p_child_record->p_shared_key
//			 * + StoC          = p_child_record->p_secret_key
//			 * + CtoS          = COSEMOpenGetHLSCtoS()
//			 * + f(StoC)       = p_data +2
//			 * + f(CtoS)       = p_out_buf
			switch (child_id)
			{
				// do the same for all associations  
				default:
				{
					Unsigned16	i;					// counter  

					Unsigned8	*p_client_fStoC;	// f(StoC) received from client  
					Unsigned8	*p_client_CtoS;		// CtoS received from client  
					Unsigned8	key[64];			// store challenge | shared key used to hash  
					Unsigned16	length = 0;			// Actual length on the key  
#if (MD5_ENABLE || SHA1_ENABLE)
					Unsigned8	hash_value[20];		// 160-bits hash result  
					// Init hash_value all 0  
					memset(hash_value, 0, 20);
#endif

					// check settings on g_ChildClass15[] & client data  
					if (p_child_record->p_authen_status == NULL ||
						p_child_record->p_secret_key == NULL ||
						b_have_client_data == 0)
					{
						// failure  
						response_result = ACTION_RESULT_SCOPE_ACCESS_VIOLATED;
						break;
					}
					
//					 * Default the authentication status is failure,
//					 * will be update to success if all verification OK
					response_result = ACTION_RESULT_SCOPE_ACCESS_VIOLATED;
					*p_child_record->p_authen_status = AUTHEN_STATUS_FAILURE;

					// Restore secret  
					{
						Unsigned16	len = strlen((void *)p_child_record->p_secret_key);
						R_USER_Class15_Secret_Restore(p_child_record->p_secret_key,
												len,
												p_child_record->mechanism_id
												);
					}

					// Use a custom secret method?  
					if (p_child_record->mechanism_id == MECHANISM_ID2_HIGH_SECURITY)
					{
//						 * TODO: put the custom verification method here
//						 * Following example:
//						 *        + use ECB encode for challenge with encypt key is shared key
//						 *        + Max size is key[64]
#if AES_ENABLE
						// Calculate f(StoC)  
						length = R_OBIS_Aes_Ecbenc(p_child_record->p_shared_key, key, p_child_record->p_secret_key);

