Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
						// Check client is authenticated or not: compare with f(StoC) from client  
						if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
							*(p_data+1) != (Unsigned8)length)
						{
							// not match, break as failure  
							break;
						}
						p_client_fStoC = p_data + 2;
						for (i = 0; i < length; i++, p_client_fStoC++)
						{
							if (key[i] != *p_client_fStoC)
							{
								break;
							}
						}
						if (i < length)
						{
							// not match, break as failure  
							break;
						}

						// Client is authenticated, processes f(CtoS) send to client  
						*(p_out_buf+0) = ATTR_TYPE_OCTET_STRING;
						p_client_CtoS = COSEMOpenGetHLSCtoS();

						length = R_OBIS_Aes_Ecbenc(p_client_CtoS, (p_out_buf + 2), p_child_record->p_secret_key);
						*(p_out_buf+1) = (Unsigned8)length;
						*p_out_len = length + 2;

						// Success  
						*p_child_record->p_authen_status = AUTHEN_STATUS_SUCCESS;
						response_result = ACTION_RESULT_SUCCESS;
#endif 					
					}
					
#if MD5_ENABLE
					// Use MD5?  
					else if (p_child_record->mechanism_id == MECHANISM_ID3_HIGH_SECURITY_MD5)
					{
						// Create the f(StoC) again  
						i = strlen((void *)p_child_record->p_shared_key);
						memcpy(key, p_child_record->p_shared_key, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						R_Md5_HashDigest(
							key,
							hash_value,
							length
						);
						
						// Verify own f(StoC) with the one that send from client  
						if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
							*(p_data+1) != 16)
						{
							// MD5 not match, break as failure  
							break;
						}

						p_client_fStoC = p_data + 2;				
						for (i = 0; i < 16; i++, p_client_fStoC++)
						{
							if (hash_value[i] != *p_client_fStoC)
							{
								break;
							}
						}
						if (i < 16)
						{
							// MD5 not match, break as failure  
							break;
						}
						
//						 * If reached here: means verify OK, then make the f(CtoS) and
//						 * send back to client
						*p_out_buf++ = ATTR_TYPE_OCTET_STRING;
						*p_out_buf++ = 16;
						*p_out_len   = 18;
						
						// Make f(CtoS) (16 bytes) then store to p_out_buf  
						p_client_CtoS = COSEMOpenGetHLSCtoS();
						i = strlen((void *)p_client_CtoS);
						memcpy(key, p_client_CtoS, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						R_Md5_HashDigest(
							key,
							p_out_buf,
							length
						);

						// Success  
						*p_child_record->p_authen_status = AUTHEN_STATUS_SUCCESS;
						response_result = ACTION_RESULT_SUCCESS;
					}
#endif

#if SHA1_ENABLE
					// Use SHA-1?  
					else if (p_child_record->mechanism_id == MECHANISM_ID4_HIGH_SECURITY_SHA1)
					{
						R_sha1	work;	// work area of SHA1  

						// Create the f(StoC) again  
						i = strlen((void *)p_child_record->p_shared_key);
						memcpy(key, p_child_record->p_shared_key, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						memset((void *)&work, 0, sizeof(R_sha1));
						if (R_Sha1_HashDigest(
								key,
								hash_value,
								length,
								(R_SHA_INIT | R_SHA_FINISH),
								&work) != R_PROCESS_COMPLETE)
						{
							// SHA-1 hash failure  
							break;
						}
						
						// Verify own f(StoC) with the one that send from client  
						if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
							*(p_data+1) != 20)
						{
							// SHA-1 not match  
							break;
						}

						p_client_fStoC = p_data + 2;				
						for (i = 0; i < 20; i++, p_client_fStoC++)
						{
							if (hash_value[i] != *p_client_fStoC)
							{
								break;
							}
						}
						if (i < 20)
						{
							// SHA-1 not match  
							break;
						}
						
//						 * If reached here: means verify OK, then make the f(CtoS) and
//						 * send back to client
						*p_out_buf++ = ATTR_TYPE_OCTET_STRING;
						*p_out_buf++ = 20;
						*p_out_len   = 22;
						
						// Make f(CtoS) (20 bytes) then store to p_out_buf  
						p_client_CtoS = COSEMOpenGetHLSCtoS();
						i = strlen((void *)p_client_CtoS);
						memcpy(key, p_client_CtoS, i);
						length = i;
						
						i = strlen((void *)p_child_record->p_secret_key);
						memcpy(key + length, p_child_record->p_secret_key, i);
						length += i;
						
						memset((void *)&work, 0, sizeof(R_sha1));
						if (R_Sha1_HashDigest(
								key,
								p_out_buf,
								length,
								(R_SHA_INIT | R_SHA_FINISH),
								&work) != R_PROCESS_COMPLETE)
						{
							// SHA-1 hash failure  
							break;
						}
						
						// Success  
						*p_child_record->p_authen_status = AUTHEN_STATUS_SUCCESS;
						response_result = ACTION_RESULT_SUCCESS;
					}
#endif
					// Use GMAC?  
					else if (p_child_record->mechanism_id == MECHANISM_ID5_HIGH_SECURITY_GMAC)
					{
//						 * GMAC verification is supported on global_key_transfer method
//						 * of security_setup_ref, not here
					}
					else
					{
						// do nothing, use default status as failure  
					}
				}
				
				break;
			}
		}
		// Method 2 - change_HLS_secret (data)?  
		else if (method_id == 2)
		{
			Unsigned8	*p_client_secret = NULL;	// secret received from client  
			// Actual length on the key  
			Unsigned8	length = (Unsigned8)strlen((void *)p_child_record->p_secret_key);

			// Check client data format  
			if (*(p_data+0) != ATTR_TYPE_OCTET_STRING ||
				*(p_data+1) != (Unsigned8)length)
			{
				// not match, break as failure  
				return (response_result);
			}
			// Point to secret  
			p_client_secret = p_data + 2;

			memcpy(p_child_record->p_secret_key, p_client_secret, length);
			// Backup secret  
			u8_data = R_USER_Class15_Secret_Backup(p_child_record->p_secret_key,
										(Unsigned8)length,
										p_child_record->mechanism_id
										);
			if (u8_data != 0)
			{
				return response_result;
			}

