Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
			response_result = ACTION_RESULT_SUCCESS;
		}
		// Method 3 - add_object (data)?  
		else if (method_id == 3)
		{
			// Do nothing  
		}
		// Method 4 - remove_object (data)?  
		else if (method_id == 4)
		{
			// Do nothing  
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_18) && USED_CLASS_18 == 1)
//	 * Handle all requests for class 18
//	 * Just do on following actions only:
//	 * 1. image_transfer_initiate (data)
//	 * 2. image_block_transfer (data)
//	 * 3. image_verify (data)
//	 * 4. image_activate (data)
	else if (class_id == 18)
	{
		// TODO: support these methods  
		response_result = ACTION_RESULT_RD_WRT_DENIED;
	}
#endif
#if (defined(USED_CLASS_20) && USED_CLASS_20 == 1)
//	 * Handle all requests for class 20
//	 * Just do on following actions only:
//	 * 1. activate_passive_calendar (data)
	else if (class_id == 20)
	{
		// Method 1 - activate_passive_calendar (data)?  
		if (method_id == 1)
		{
			R_USER_WDT_Restart();
			
			record_transaction_event(ACTIVITY_CALENDAR_TRANSACTION_MASK);	// in this function rtc is read
			Common_Data.pgm_count++;
			
// the following two lines are not required as generate_bill saves Common_Data
//			e2write_flags|=E2_W_IMPDATA;
//			wre2rom(); // write the tamper here itself			
			generate_bill(rtc.date, rtc.month, rtc.year, rtc.hour, rtc.minute, rtc.second, BT_TRANS);
			u8_data = R_OBIS_Class20_Activate_PassiveCalendar(child_id);
			
//			write_active_tod();	// being done in R_OBIS_Class20_Activate_PassiveCalendar
			if(u8_data == 0)
			{
				response_result = ACTION_RESULT_SUCCESS;
			}
		}
	}
#endif
#if (defined(USED_CLASS_70) && USED_CLASS_70 == 1)
//	 * Handle all requests for class 70
//	 * Just do on following actions only:
//	 * 1. remote_disconnect (data)
//	 * 2. remote_reconnect (data)
	else if (class_id == 70)
	{
		//switch(method_id)
		//{
		//	case 1: break;
		//	case 2: break;
		//}
		//Set_PP(method_id,38);
		// TODO: support these methods  
		response_result = ACTION_RESULT_SUCCESS;
	}
#endif
	else
	{
		return ACTION_RESULT_TYPE_UNMATCH;
	}
	
	return (response_result);
}


//int32_t gResult;

Unsigned8 R_OBIS_GetObjectAttr(
	st_Cosem_Attr_Desc *cosem_attr_desc,
	service_type_t service_type,
	Unsigned16 child_id,
	Unsigned8  *p_out_buf,
	Unsigned16 *p_out_len,
	Unsigned8 *block_transfer,
	Unsigned8 *p_data
)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;

	// Vars used to handle processing  
	Unsigned16 class_id;
	Unsigned16 attr_id;

	// Vars used to encode data  
	void        *pbuffer;
	Integer16   size;
	Unsigned8	u8_data;
	Unsigned16  u16_data;
	Unsigned32  u32_data;
	Integer32   f32_data;
	attr_type_t type;

	// Params check  
	if (cosem_attr_desc == NULL ||
		p_out_buf == NULL ||
		p_out_len == NULL ||
		block_transfer == NULL)
	{
		return TYPE_UNMATCH;
	}

	// Get information from attr descriptor  
	class_id = (
		((Unsigned16)cosem_attr_desc->Class_ID[0] << 8) |
		((Unsigned16)cosem_attr_desc->Class_ID[1])
	);
	attr_id = cosem_attr_desc->Attr_ID;

//	 * Default, marked to response to object layer that not use block transfer
//	 * Change this value to 1 at relative class processing (in below) to inform to
//	 * object layer that R_OBIS_GetObjectAttr() need to use block transfer
	*block_transfer = 0;

//	 * Temporary if (0) to prevent compile error
//	 * when no class is used
	if (0)
	{
		// Do nothing  
	}
#if (defined(USED_CLASS_01) && USED_CLASS_01 == 1)
//	 * Handle all requests for class 01
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - value : CHOICE
//	 * All other attributes are handled in R_OBIS_DistributeDataClass() function.
	else if (class_id == 1)
	{
		class01_child_record_t	*p_child_record1;

		date_time_t date_time;

		// Get the child record  
		p_child_record1 = (class01_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

		// Attr 2 - value : CHOICE ?  
		if (attr_id == 2)
		{
			Unsigned8 u8;
			Unsigned16 u16;
			Unsigned32 u32;
//			Unsigned8 buffer[16];
			Unsigned8 buffer[40];
			memset(buffer, 0, 40);
			// Default  
			pbuffer = buffer;

			// Get the size from child table definition  
			size = p_child_record1->value.choice.size;

			// Get the buffer pointer  
			switch (child_id)
			{
				
				case 0:
					
					size =  R_USER_GetNamePlate(NAME_PLATE_LOGICAL_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
						break;
					
				case 1:		// Meter serial number  
					size =  R_USER_GetNamePlate(NAME_PLATE_METER_SERIAL, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 2:		// Manufacture Name  
					size =  R_USER_GetNamePlate(NAME_PLATE_MANUFACT_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 3:		// Firmware Version for meter  
					size =  R_USER_GetNamePlate(NAME_PLATE_FIRMWARE_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 4:		// Meter Type  
					size =  R_USER_GetNamePlate(NAME_PLATE_METER_TYPE, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 5:		// Category  
					size =  R_USER_GetNamePlate(NAME_PLATE_CATEGORY_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 6:		// Current rating  
					size =  R_USER_GetNamePlate(NAME_PLATE_CURRRATE_NAME, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;

				case 7:		// Meter Year of Manufacture  
					size =  R_USER_GetNamePlate(NAME_PLATE_YEAR_OF_MANUFACT, pbuffer);
					if (size < 0)
					{
						return 0;
					}
					break;
							
				case 8:		// Demand Integration Period  
					u16 = (Unsigned16)R_USER_GetEMData(DEMAND_INTEGRATION_PERIOD);
					pbuffer = (Unsigned8 *)&u16;
					break;
					
				case 9:		// Profile Capture Period   //NEED TO CHECK // Block load capture period??  
					u16 = (Unsigned16)R_USER_GetEMData(PROFILE_CAPTURE_PERIOD);
					pbuffer = (Unsigned8 *)&u16;
					break;

				case 11:	// Cumulative tamper count  
					u16 = (Unsigned16)R_USER_GetEMData(CUM_TAMPER_CNT);
					pbuffer = (Unsigned8 *)&u16;
					break;

				case 12:	// Cumulative billing count  
					u32 = (Unsigned32)R_USER_GetEMData(CUM_BILLING_CNT);
					pbuffer = (Unsigned8 *)&u32;
					break;

				case 13:	// Cumulative programming count  
					u16 = (Unsigned16)R_USER_GetEMData(CUM_PROGAM_CNT);
					pbuffer = (Unsigned8 *)&u16;
					break;

				case 14:	// EventCode  
				case 15:
				case 16:
				case 17:
				case 18:
				case 19:
					pbuffer = &g_Class01_EventCode[child_id-14];
					break;
				case 20:	// Available Billing Period  
					u8 = (Unsigned8)R_USER_GetEMData(AVL_BILLING_PERIOD);;   //NEED IMPLEMENTATION
					pbuffer = (Unsigned8 *)&u8;
					break;
				case 21:	// No. Of Power Failure  
//					u32 = 10;//(Unsigned32)R_USER_GetEMData(EM_CUCUMLARIVE_BILLING_CNT);
					u32 = (Unsigned32)R_USER_GetEMData(CUM_POWER_FAILURE_COUNT);
					pbuffer = (Unsigned8 *)&u32;
					break;
				case 22:	// Internal CT ratio*  
					u16 =1; //(Unsigned16)R_USER_GetEMData(EM_CUCUMLARIVE_PROGAM_CNT);
					pbuffer = (Unsigned8 *)&u16;
					break;
				case 23:	// Internal VT ratio*  
					u16 = 1;
					pbuffer = (Unsigned8 *)&u16;
					break;
				case 24:	// Phase Sequence  
					if((g_TamperStatus&MISSPOT_MASK)==0)
					{// here no potential is missing
						u16=gPhaseSequence;
					}
					else
					{// here some potential is missing
						u16=255;
					}
					pbuffer = (Unsigned8 *)&u16;
					break;
				case 25:	// Rising Demand kva  
			    u8=60/(int32_t)Common_Data.mdinterval;
					if(myenergydata.kvah>ctldata.kvah_last_saved)
						u16 = ((myenergydata.kvah-ctldata.kvah_last_saved)*(int32_t)u8);
					else
					{
						ctldata.kvah_last_saved=myenergydata.kvah;
						u16=0;
					}
					pbuffer = (Unsigned8 *)&u16;
					break;
					
				case 26:	// Rising Demand kva elapsed time  
					u16 = rtc.minute - ((rtc.minute/Common_Data.mdinterval)*Common_Data.mdinterval); 
					pbuffer = (Unsigned8 *)&u16;
					break;
					
				case 27:	// Self Diagnostic - rtcBattery(bit0), memcheck(bit1)
					u16 = Common_Data.rtc_failed;	// 1 - batt bad, 0 - batt good 
					if(0!=perform_E2ROM12_Test())
						u16=u16+2;
					pbuffer = (Unsigned8 *)&u16;
					break;
					
				default:
					break;
			}
			// Determind the size, based on buffer  
			if (pbuffer != NULL &&
				size == -1)
			{
				size = strlen((void*)pbuffer);
			}

