Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
			// Encode & indicate as success when buffer is valid  
			if (pbuffer != NULL &&
				size != -1)
			{
				*p_out_len = R_OBIS_EncodeAttribute(
					p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
					OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
					p_child_record1->value.choice.type,		// Type  
					(Unsigned8 *)pbuffer,					// Buffer  
					size									// Length  
				);

				// Success  
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_03) && USED_CLASS_03 == 1)
//	 * Handle all requests for class 03
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - value : CHOICE.
//	 * 2. Attr 3 - scaler_unit : scal_unit_type
//	 * All other attributes are handled in R_OBIS_DistributeRegisterClass() function.
	else if (class_id == 3)
	{
		class03_child_record_t	*p_child_record3;

		// Get the child record  
		p_child_record3 = (class03_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

		// Attr 2 - value : CHOICE ?  
		if (attr_id == 2)
		{
			Integer32 temp32;
			Integer32 tempAnother;
			date_time_t temp_time;
			Unsigned16 u16;
			
			// Get the size from child table definition  
			size = p_child_record3->value.choice.size;

			// Get the buffer pointer  
			switch (child_id)
			{
				case 0:		// Ir  
					temp32 = R_USER_GetEMData(I_R);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 1:		// Iy  
					temp32 = R_USER_GetEMData(I_Y);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 2:		// Ib  
					temp32 = R_USER_GetEMData(I_B);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 3:		// Vr  
					temp32 = R_USER_GetEMData(V_R);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 4:		// Vy  
					temp32 = R_USER_GetEMData(V_Y);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 5:		// Vb  
					temp32 = R_USER_GetEMData(V_B);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 6:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_R);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 7:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_Y);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 8:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_B);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 9:		// Signed Power Factor  
					temp32 = R_USER_GetEMData(PF_TOTAL);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 10:		// Frequency  
					temp32 = R_USER_GetEMData(FREQUENCY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 11:		// Apparent Power  
					temp32 = R_USER_GetEMData(APPARENT_POWER);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 12:		// Active Power  
					temp32 = R_USER_GetEMData(ACTIVE_POWER);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 13:		// Reactive Power  
					temp32 = R_USER_GetEMData(REACTIVE_POWER);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 14:		// Cumulative Energy - kWh  
					temp32 = R_USER_GetEMData(CUM_ACTIVE_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 15:		// Cumulative Energy - kvarh(lag)  
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LAG_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 16:		// Cumulative Energy - kvarh(lead)  
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LEAD_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 17:		// Cumulative Energy - kVAh  
					temp32 = R_USER_GetEMData(CUM_APPARENT_ENERGY);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 18:		// Cumulative power-failure duration  
// there is another implementation in r_dlms_user_interface.R_USER_GetEMData
// we might as well call that function
					temp32 = R_USER_GetEMData(CUM_POWER_FAILURE_DURN);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 19:		// Billing date  
					temp32 = Common_Data.billing_date;	// this should be a string?
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 20:		// Block Energy kwh  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KWH);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 21:		// Block Energy kvarh lag  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KVARH_LAG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 22:		// Block Energy kvarh lead  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KVARH_LEAD);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 23:		// Block Energy kvah  
					temp32 = R_USER_GetEMData(EM_BLOCK_ENERGY_KVAH);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 24:		// Power On Duration in Minutes for Current Month  
					temp32 = R_USER_GetEMData(POWER_ON_DURATION);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 25:		// Cumulative Tamper Count
					temp32 = R_USER_GetEMData(CUM_TAMPER_CNT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

#ifdef BIDIR_METER
				case 26:		// Ir - avg 
					temp32 = R_USER_GetEMData(I_R_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 27:		// Iy - avg 
					temp32 = R_USER_GetEMData(I_Y_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 28:		// Ib  - avg
					temp32 = R_USER_GetEMData(I_B_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 29:		// Vr  - avg
					temp32 = R_USER_GetEMData(V_R_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 30:		// Vy  - avg
					temp32 = R_USER_GetEMData(V_Y_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 31:		// Vb  - avg
					temp32 = R_USER_GetEMData(V_B_AVG);					
					pbuffer = (Unsigned8 *)&temp32;
					break;

				case 32:		// Cumulative Energy - kWh  Export
					temp32 = R_USER_GetEMData(CUM_ACTIVE_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 33:		// Cumulative Energy - kvarh(lag)  Export  
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LAG_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				case 34:		// Cumulative Energy - kvarh(lead)   Export
					temp32 = R_USER_GetEMData(CUM_REACTIVE_LEAD_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
