Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
				case 35:		// Cumulative Energy - kVAh   Export
					temp32 = R_USER_GetEMData(CUM_APPARENT_ENERGY_EXPORT);					
					pbuffer = (Unsigned8 *)&temp32;
					break;
#endif

#ifdef BIDIR_METER
				case 36:		// high res kwh
#else
				case 26:		// high res kwh
#endif
					temp32 = ((myenergydata.kwh%100000)*100)+(int32_t)high_resolution_kwh_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 37:		// high res kvah
#else
				case 27:		// high res kvah
#endif
					temp32 = ((myenergydata.kvah%100000)*100)+(int32_t)high_resolution_kvah_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 38:		// high res kvarh_lag -38
#else
				case 28:		// high res kvarh_lag -38
#endif
					temp32 = ((myenergydata.kvarh_lag%100000)*100)+(int32_t)high_resolution_kvarh_lag_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 39:		// high res kvarh_lead
#else
				case 29:		// high res kvarh_lead
#endif
					temp32 = ((myenergydata.kvarh_lead%100000)*100)+(int32_t)high_resolution_kvarh_lead_value;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 40:		// Cumulative Energy - kwh lag
#else
				case 30:		// Cumulative Energy - kwh lag
#endif

	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kwh_lag;
  #else
					temp32 = 0;
	#endif
//					temp32 = 12345678;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 41:		// Cumulative Energy - kwh lead
#else
				case 31:		// Cumulative Energy - kwh lead
#endif
	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kwh_lead;
	#else
					temp32 = 0;
	#endif
//					temp32 = 87654321;
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 42:		// Cumulative Energy - kVAh lag
#else
				case 32:		// Cumulative Energy - kVAh lag
#endif
	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kvah_lag;
  #else
					temp32 = 0;
	#endif
	
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
#ifdef BIDIR_METER
				case 43:		// Cumulative Energy - kVAh lead
#else
				case 33:		// Cumulative Energy - kVAh lead
#endif
	#ifdef SPLIT_ENERGIES_REQUIRED		
					temp32 = myenergydata.kvah_lead;
  #else
					temp32 = 0;
	#endif
					
					pbuffer = (Unsigned8 *)&temp32;
					break;
					
				default:
					break;
			}
			// Determind the size, based on buffer  
			if (pbuffer != NULL &&
				size == -1)
			{
				size = strlen((void*)pbuffer);
			}

			// Encode & indicate as success when buffer is valid  
			if (pbuffer !=NULL)
			{
				*p_out_len = R_OBIS_EncodeAttribute(
					p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
					OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
					p_child_record3->value.choice.type,		// Type  
					(Unsigned8 *)pbuffer,					// Buffer  
					size									// Length  
				);

				// Success  
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_04) && USED_CLASS_04 == 1)
//	 * Handle all requests for class 04
//	 * Just do on following attributes only:
//	 * 1. Logical name (OBIS code) of the object.
//	 * 2. Access right definition for 1 object   
//	 * 3  Value                                  
//	 * 4  Scaler, unit                           
//	 * 5  Status                                 
//	 * 6  Capture time buffer                    
//	 * All other attributes are handled in R_OBIS_DistributeRegisterClass() function.
	else if (class_id == 4)
	{
		class04_child_record_t	*p_child_record4;

		// Get the child record  
		p_child_record4 = (class04_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

		// Attr 2 - value : CHOICE ?  
		if (attr_id == 2)
		{
			Unsigned32 temp_f32;
			void *buff = NULL;

			// Get the buffer pointer  
			switch (child_id)
			{
				case 0:		// Maximum Demand  kW  
					temp_f32 = R_USER_GetEMData(EM_ACTIVE_MD);
					buff = &temp_f32;
					break;
					
				case 1:		// Maximum Demand  kVA  
					temp_f32 = R_USER_GetEMData(EM_APPARENT_MD);
					buff = &temp_f32;
					break;

				case 2:		// Maximum Demand  kW - export  
					temp_f32 = R_USER_GetEMData(EM_ACTIVE_MD_EXPORT);
					buff = &temp_f32;
					break;
					
				case 3:		// Maximum Demand  kVA  - export
					temp_f32 = R_USER_GetEMData(EM_APPARENT_MD_EXPORT);
					buff = &temp_f32;
					break;
					
					
				default:
					break;
			}

			// Encode & indicate as success when buffer is valid  
			if (buff !=NULL)
			{
				*p_out_len = R_OBIS_EncodeAttribute(
					p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
					OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
					p_child_record4->value.choice.type,		// Type  
					(Unsigned8 *)buff,						// Buffer  
					p_child_record4->value.choice.size		// Length  
				);

				// Success  
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
		}
		// Attr 5 - capture_time : octet-string  
		if (attr_id == 5)
		{
			date_time_t temp_time;
			switch (child_id)
			{
				case 0:		// Maximum Demand  kW  
					{
						Unsigned8 rlt;
						// Get time  
						rlt = R_USER_GetSpecificTime(LAST_ACTIVE_MD_TIME, &temp_time);
						if (rlt != 0)
						{
							return (response_result);
						}
					}
					break;
				case 1:		// Maximum Demand  kVA  
					{
						Unsigned8 rlt;
						// Get time  
						rlt = R_USER_GetSpecificTime(LAST_APPARENT_MD_TIME, &temp_time);
						if (rlt != 0)
						{
							return (response_result);
						}
						break;
					}
					
//					break;
				default:
					return response_result;
			}
			*p_out_len = R_OBIS_EncodeAttribute(
						p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
						OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
						ATTR_TYPE_OCTET_STRING,					// Type  
						(Unsigned8 *)&temp_time,				// Buffer  
						sizeof(date_time_t)						// Length  
						);
			// Success  
			response_result = DATA_ACCESS_RESULT_SUCCESS;
		}
		else
		{
			// Do nothing  
		}
	}
#endif
#if (defined(USED_CLASS_08) && USED_CLASS_08 == 1)
//	 * Handle all requests for class 08
//	 * NOTE: THE CLASS 08 ALLOW ONLY 1 INSTANCE TO BE IMPLEMENTED.
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - time : octet-string.
//	 * 2. Attr 3 - time_zone : long
//	 * 3. Attr 4 - status : unsigned
//	 * 4. Attr 5 - daylight_savings_begin : octet-string
//	 * 5. Attr 6 - daylight_savings_end : octet-string
//	 * 6. Attr 7 - daylight_savings_deviation : integer
//	 * 7. Attr 8 - daylight_savings_enabled : boolean
//	 * 8. Attr 9 - clock_base : enum
//	 * All other attributes are handled in R_OBIS_DistributeClockClass() function.
	else if (class_id == 8)
	{
		// Attr 2 - time : octet-string.  
		if (attr_id == 2)
		{
			date_time_t class8_currenttime;
			Unsigned8 rlt;
			switch (child_id)
			{
				case 0:		// RTC time  
					// Get current time  
					rlt = R_USER_GetSpecificTime(CURRENT_TIME, &class8_currenttime);
					if (rlt != 0)
					{
						return (response_result);
					}

					*p_out_len = R_OBIS_EncodeAttribute(
						p_out_buf,								// Output buffer, pointed to g_ServiceBuffer  
						OBIS_SERVICE_DATA_BUFFER_LENGTH,		// Max length of g_ServiceBuffer  
						ATTR_TYPE_OCTET_STRING,					// Type  
						(Unsigned8 *)&class8_currenttime,	// Buffer  
						sizeof(date_time_t)						// Length  
						);

						// Success  
					response_result = DATA_ACCESS_RESULT_SUCCESS;
					break;
				default:
					break;
			}
		}
		else
		{
			// Do nothing  
		}

