Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_data.c
	}
#endif
	else
	{
		return SCOPE_ACCESS_VIOLATED;
	}

	return (response_result);
}

Unsigned8 R_OBIS_SetObjectAttr(
	st_Cosem_Attr_Desc *cosem_attr_desc,
	service_type_t service_type,
	Unsigned16 child_id,
	Unsigned8 *p_data,
	Unsigned16 data_len,
	Unsigned8 block_transfer
)
{
	// Result of response, def. is not Matched
	Unsigned8 response_result = TYPE_UNMATCH;

	// Vars used to handle processing  
	Unsigned16 class_id;
	Unsigned16 attr_id;

	// Vars used to encode data  
	void        *pbuffer;
	Unsigned16  length;
	Unsigned8	u8_data;
	Unsigned16  u16_data;
	Unsigned32  u32_data;
	Integer32   f32_data;
	attr_type_t type;

			date_time_t user_time;
			date_time_t current_time;
			int8_t match_result;
			Unsigned8 ret;
	
	
	// Params check  
	if (cosem_attr_desc == NULL ||
		p_data == NULL ||
		data_len == 0)
	{
		return TYPE_UNMATCH;
	}

	// Get information from attr descriptor  
	class_id = (
		((Unsigned16)cosem_attr_desc->Class_ID[0] << 8) |
		((Unsigned16)cosem_attr_desc->Class_ID[1])
	);
	attr_id = cosem_attr_desc->Attr_ID;

	if (0)
	{
		// Do nothing  
	}//RC
	#if (defined(USED_CLASS_01) && USED_CLASS_01 == 1)
//	 * Handle all requests for class 01
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - value : CHOICE
//	 *
//	 * All other attributes are handled in R_OBIS_DistributeDataClass() function.

	else if (class_id == 1)
	{
		class01_child_record_t	*p_child_record1;
		// Get the child record  
		p_child_record1 = (class01_child_record_t *)(
			R_OBIS_FindChildRecordByIndex(class_id, child_id)
		);

		// Attr 2 - value : CHOICE ?  
		if (attr_id == 2)
		{
			Unsigned16 u16;
			Integer16 size;
			void *buffer = NULL;

		u16 = 0;
		length = R_OBIS_DecodeAttribute(
						(Unsigned8 *)&u16,							// value_buf  
						p_child_record1->value.choice.size,			// value_buf_len  
						p_child_record1->value.choice.type,			// attr_type  
						p_data,										// buf  
						OBIS_SERVICE_DATA_BUFFER_LENGTH				// buf_len  
					);

			// Get the buffer pointer  
			switch (child_id)
			{
				case 8:		// Demand Integration Period  
					length = (Unsigned16)R_USER_SetEMData(DEMAND_INTEGRATION_PERIOD, (void *)u16);
					response_result = DATA_ACCESS_RESULT_SUCCESS;
					break;
				case 9:		// Block load capture period  
					length = (Unsigned16)R_USER_SetEMData(PROFILE_CAPTURE_PERIOD, (void *)u16);
					response_result = DATA_ACCESS_RESULT_SUCCESS;
					break;
//				case 11:	// Cumulative tamper count  
//					length = (Unsigned16)R_USER_SetEMData(EM_CUCUMLARIVE_TAMPER_CNT, (void *)&u16);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//				case 12:	// Cumulative billing count  
//					length = (Unsigned16)R_USER_SetEMData(EM_CUCUMLARIVE_BILLING_CNT, (void *)&u16);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//				case 13:	// Cumulative programming count  
//					length = (Unsigned16)R_USER_SetEMData(EM_CUCUMLARIVE_PROGAM_CNT, (void *)&u16);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//					
//				case 20:
//					Set_PP(u16,31);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//					
//				case 21:
//					Set_PP(u16,32);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//					
//				case 22:
//					Set_PP(u16,33);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//					
//				case 23:
//					Set_PP(u16,34);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//					
//				case 24:
//					Set_PP(u16,35);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//					
//				case 25:
//					Set_PP(u16,36);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;
//					
//				case 26:
//					Set_PP(u16,37);
//					response_result = DATA_ACCESS_RESULT_SUCCESS;
//					break;

				default:
					break;
				
			}
		}
	}
#endif
#if (defined(USED_CLASS_08) && USED_CLASS_08 == 1)
//	 * Handle all requests for class 08
//	 *
//	 * NOTE: THE CLASS 08 ALLOW ONLY 1 INSTANCE TO BE IMPLEMENTED.
//	 *
//	 * Just do on following attributes only:
//	 * 1. Attr 2 - time : octet-string.
//	 * 2. Attr 3 - time_zone : long
//	 * 3. Attr 4 - status : unsigned
//	 * 4. Attr 5 - daylight_savings_begin : octet-string
//	 * 5. Attr 6 - daylight_savings_end : octet-string
//	 * 6. Attr 7 - daylight_savings_deviation : integer
//	 * 7. Attr 8 - daylight_savings_enabled : boolean
//	 * 8. Attr 9 - clock_base : enum
//	 *
//	 * All other attributes are handled in R_OBIS_DistributeClockClass() function.
	else if (class_id == 8)
	{
		// Attr 2 - time : octet-string.  
		if (attr_id == 2)
		{
			switch (child_id)
			{
				case 0:		// RTC time  
					length = R_OBIS_DecodeAttribute(
							(Unsigned8 *)&user_time,					// value_buf  
							sizeof(date_time_t),						// value_buf_len  
							ATTR_TYPE_DATE_TIME,						// attr_type  
							p_data,										// buf  
							OBIS_SERVICE_DATA_BUFFER_LENGTH				// buf_len  
						);

					if (length == sizeof(date_time_t) + 2)
					{// gaurav
						user_time.day_of_week=NOT_SPECIFIED;
						user_time.hundredths=NOT_SPECIFIED;
						user_time.deviation_high=NOT_SPECIFIED;
						user_time.deviation_low=NOT_SPECIFIED;
						user_time.clock_status=NOT_SPECIFIED;
						
//						if (R_OBIS_IsValidDateTime((Unsigned8 *)&user_time)== 0) // Invalid
						if (R_OBIS_IsValidDateTime(p_data) == 0) // Invalid
						{
							response_result=ACTION_RESULT_TYPE_UNMATCH;
							break;
						}
						
//----------------------------------------------------------------------	

						ConvertRTCDate(&current_time, &rtc);
						match_result = R_OBIS_CompareDate((Unsigned8 *)&user_time, (Unsigned8 *)&current_time);
#ifndef TESTING						
						if(match_result<0)
						{// given date is in the past - not acceptable
							response_result=ACTION_RESULT_TYPE_UNMATCH;
							break;
						}
#endif						
//----------------------------------------------------------------------	

						// Set current time  
						ret = R_USER_SetSpecificTime(CURRENT_TIME, user_time);
						if(ret != 0)
						{
							return response_result;
						}
						// Success  
						record_transaction_event(RTC_TRANSACTION_MASK);
						response_result = DATA_ACCESS_RESULT_SUCCESS;
					}
					break;
				default:
					break;
			}
		}
		else if (attr_id == 3)
		{
			
